app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("name", "email", "number", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["email", ""], ["number", ""], ["comment", ""], ["created_at", "2017-06-01 01:19:36.390579"], ["updated_at", "2017-06-01 01:19:36.390579"]]

  def update
    respond_to do |format|
      if @message.update(message_params)
---
UPDATE "messages" SET "name" = $1, "number" = $2, "comment" = $3, "updated_at" = $4 WHERE "messages"."id" = $5  [["name", "www"], ["number", "ss"], ["comment", "ss"], ["updated_at", "2017-06-02 09:57:39.323179"], ["id", 1]]

    def set_message
      @message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]